### **Realizando o tratamento de dados**

In [1]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\daniel bezerra\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\daniel bezerra\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
# Trazando os dados para serem tratados
dados = pd.read_excel("base_vendas_completa.xlsx")

In [4]:
# tratando a aba de clientes
clientes = pd.read_excel("base_vendas_completa.xlsx",sheet_name="clientes")
produtos = pd.read_excel("base_vendas_completa.xlsx",sheet_name="produtos")
calendario = pd.read_excel("base_vendas_completa.xlsx",sheet_name="calendario")
vendas=pd.read_excel("base_vendas_completa.xlsx",sheet_name="vendas")

In [5]:
#tratando a primeira tabela "clientes"

clientes.head()

   id_cliente    nome          cidade estado sexo  idade
0           1     Eva       São Paulo     MG    F   57.0
1           2    Gabi        Curitiba     PR    M   47.0
2           3     Ana  Belo Horizonte     BA    F    NaN
3           4  Daniel       São Paulo     BA    F   41.0
4           5  Daniel        Curitiba     MG    M   37.0

In [6]:
#verificando se existe valores nulos
clientes.isnull().sum()

id_cliente    0
nome          0
cidade        0
estado        0
sexo          0
idade         7
dtype: int64

In [7]:
# preenchendo os valores nulos da coluna idade 

idade_media = clientes["idade"].mean()
clientes["idade"] = clientes["idade"].fillna(idade_media)
clientes.head()
clientes["idade"] = clientes["idade"].astype(int)
clientes.head()

   id_cliente    nome          cidade estado sexo  idade
0           1     Eva       São Paulo     MG    F     57
1           2    Gabi        Curitiba     PR    M     47
2           3     Ana  Belo Horizonte     BA    F     49
3           4  Daniel       São Paulo     BA    F     41
4           5  Daniel        Curitiba     MG    M     37

In [8]:
#verificando se há duplicidade de valores na aba de clientes

clientes.duplicated().sum()

np.int64(0)

In [9]:
#verificando a padronização da coluna "estado"

clientes["estado"].unique()

array(['MG', 'PR', 'BA', 'RJ', 'SP'], dtype=object)

In [10]:
# padronizando as colunas, retirando os espacos

clientes["nome"] = clientes["nome"].str.strip()
clientes["cidade"] = clientes["cidade"].str.strip()
clientes["estado"] = clientes["estado"].str.strip()
clientes.head()

   id_cliente    nome          cidade estado sexo  idade
0           1     Eva       São Paulo     MG    F     57
1           2    Gabi        Curitiba     PR    M     47
2           3     Ana  Belo Horizonte     BA    F     49
3           4  Daniel       São Paulo     BA    F     41
4           5  Daniel        Curitiba     MG    M     37

In [11]:
clientes["cidade"].unique()

array(['São Paulo', 'Curitiba', 'Belo Horizonte', 'Salvador',
       'Rio de Janeiro'], dtype=object)

In [12]:
#verificando o tipo de dados de cada coluna

clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  20 non-null     int64
 1   nome        20 non-null     object
 2   cidade      20 non-null     object
 3   estado      20 non-null     object
 4   sexo        20 non-null     object
 5   idade       20 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [13]:
clientes.to_excel("clientes_dados_tratados.xlsx",index=False)

In [14]:
# Tratando a aba "produtos"

produtos.head()

,id_produto,categoria,subcategoria,nome_produto,preco_base,fornecedor
0,1,Eletrônicos,Camisetas,Mouse,58.92,Fornecedor B
1,2,Eletrônicos,Acessórios,Mouse,71.16,Fornecedor B
2,3,Eletrônicos,Bebidas,Teclado,120.50,Fornecedor C
3,4,Roupas,Camisetas,Camiseta Azul,38.30,Fornecedor C
4,5,Roupas,Bebidas,Refrigerante,45.37,Fornecedor C

In [15]:
#verificando o tipo de dados 

produtos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id_produto    15 non-null     int64
 1   categoria     15 non-null     object
 2   subcategoria  15 non-null     object
 3   nome_produto  15 non-null     object
 4   preco_base    10 non-null     float64
 5   fornecedor    15 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 852.0+ bytes

In [16]:
# verificando dados nulos

produtos.isnull().sum()

id_produto      0
categoria       0
subcategoria    0
nome_produto    0
preco_base      5
fornecedor      0
dtype: int64

In [17]:
#tratando os dados nulos com preco medio

preco_medio = produtos["preco_base"].mean()
produtos["preco_base"] = produtos["preco_base"].fillna(preco_medio)
produtos.head()

,id_produto,categoria,subcategoria,nome_produto,preco_base,fornecedor
0,1,Eletrônicos,Camisetas,Mouse,58.92,Fornecedor B
1,2,Eletrônicos,Acessórios,Mouse,71.16,Fornecedor B
2,3,Eletrônicos,Bebidas,Teclado,120.50,Fornecedor C
3,4,Roupas,Camisetas,Camiseta Azul,38.30,Fornecedor C
4,5,Roupas,Bebidas,Refrigerante,45.37,Fornecedor C

In [18]:
# verificando duplicidade de dados

produtos.duplicated().sum()

np.int64(0)

In [19]:
# tratando os dados inválidos de categoria e subcategoria

correcao_subcat = {
    "Mouse": "Eletrônicos",
    "Teclado": "Eletrônicos",
    "Acessórios": "Eletrônicos",
    "Camisetas": "Roupas",
    "Camiseta Azul": "Roupas",
    "Refrigerante": "Bebidas"
}

produtos["categoria"] = produtos["subcategoria"].map(correcao_subcat)

In [20]:
produtos.head()

,id_produto,categoria,subcategoria,nome_produto,preco_base,fornecedor
0,1,Roupas,Camisetas,Mouse,58.92,Fornecedor B
1,2,Eletrônicos,Acessórios,Mouse,71.16,Fornecedor B
2,3,NaN,Bebidas,Teclado,120.50,Fornecedor C
3,4,Roupas,Camisetas,Camiseta Azul,38.30,Fornecedor C
4,5,NaN,Bebidas,Refrigerante,45.37,Fornecedor C

In [21]:
mapa_categoria = {
    "Camisetas": "Roupas",
    "Acessórios": "Eletrônicos",
    "Bebidas": "Bebidas"
}

produtos["categoria"] = produtos["subcategoria"].map(mapa_categoria)

In [22]:
produtos.head()

,id_produto,categoria,subcategoria,nome_produto,preco_base,fornecedor
0,1,Roupas,Camisetas,Mouse,58.92,Fornecedor B
1,2,Eletrônicos,Acessórios,Mouse,71.16,Fornecedor B
2,3,Bebidas,Bebidas,Teclado,120.50,Fornecedor C
3,4,Roupas,Camisetas,Camiseta Azul,38.30,Fornecedor C
4,5,Bebidas,Bebidas,Refrigerante,45.37,Fornecedor C

In [23]:
correcao_nome = {
    "Camisetas": "Camiseta Azul",
    "Acessórios": "Mouse",
    "Bebidas": "Refrigerante"
}


produtos["nome_produto"] = produtos["subcategoria"].map(correcao_nome)

In [24]:
produtos.head()

,id_produto,categoria,subcategoria,nome_produto,preco_base,fornecedor
0,1,Roupas,Camisetas,Camiseta Azul,58.92,Fornecedor B
1,2,Eletrônicos,Acessórios,Mouse,71.16,Fornecedor B
2,3,Bebidas,Bebidas,Refrigerante,120.50,Fornecedor C
3,4,Roupas,Camisetas,Camiseta Azul,38.30,Fornecedor C
4,5,Bebidas,Bebidas,Refrigerante,45.37,Fornecedor C

In [25]:
produtos.isnull().sum()

id_produto      0
categoria       0
subcategoria    0
nome_produto    0
preco_base      0
fornecedor      0
dtype: int64

**Não possui Valores nulos**

In [26]:
# salvando os dados tratados na tabela "produtos"

produtos.to_excel("produtos_dados_tratados.xlsx",index=False)

In [27]:
# tratando dados da tabela "calendario"

calendario.head()

         data  dia  mes  trimestre   ano feriado
0  2024-01-01    1    1          1  2024     Não
1  2024-01-02    2    1          1  2024     Não
2  2024-01-03    3    1          1  2024     Sim
3  2024-01-04    4    1          1  2024     Sim
4  2024-01-05    5    1          1  2024     Não

In [28]:
calendario.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   data       365 non-null    object
 1   dia        365 non-null    int64
 2   mes        365 non-null    int64
 3   trimestre  365 non-null    int64
 4   ano        365 non-null    int64
 5   feriado    248 non-null    object
dtypes: int64(4), object(2)
memory usage: 17.2+ KB

In [29]:
# convertendo o formato da coluna "data"

calendario["data"]= pd.to_datetime(calendario["data"])

In [30]:
# verificando se há dados nulos

calendario.isnull().sum()

data           0
dia            0
mes            0
trimestre      0
ano            0
feriado      117
dtype: int64

In [31]:
#tratando os dados nulos

calendario["feriado"] = calendario["feriado"].fillna("Não")

In [32]:
calendario.head()

        data  dia  mes  trimestre   ano feriado
0 2024-01-01    1    1          1  2024     Não
1 2024-01-02    2    1          1  2024     Não
2 2024-01-03    3    1          1  2024     Sim
3 2024-01-04    4    1          1  2024     Sim
4 2024-01-05    5    1          1  2024     Não

In [33]:
calendario.duplicated().sum()

np.int64(0)

In [34]:
# salvando a aba "calendario"

calendario.to_excel("calendario_dados_tratados.xlsx", index=False)

In [36]:
# tratando dados tabela "vendas"

vendas.head()

,id_venda,data,id_cliente,id_produto,quantidade,preco_unitario,desconto,custo,canal
0,1,2024-01-16,17,15,3,309.52,0.05,78.17,Parceiro
1,2,2024-05-29,19,15,5,317.05,0.00,199.98,Loja
2,3,2024-02-01,20,8,1,17.43,NaN,51.78,Parceiro
3,4,2024-08-04,15,11,3,332.46,NaN,44.03,Parceiro
4,5,2024-07-24,14,8,2,140.75,0.10,23.26,Site

In [46]:
#Verificando o tipo de dados

vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_venda        100 non-null    int64
 1   data            100 non-null    datetime64[ns]
 2   id_cliente      100 non-null    int64
 3   id_produto      100 non-null    int64
 4   quantidade      100 non-null    int64
 5   preco_unitario  100 non-null    float64
 6   desconto        72 non-null     float64
 7   custo           100 non-null    float64
 8   canal           100 non-null    object
dtypes: datetime64[ns](1), float64(3), int64(4), object(1)
memory usage: 7.2+ KB

In [47]:
# alterando o tipo  da coluna data

vendas["data"] = pd.to_datetime(vendas["data"])
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_venda        100 non-null    int64
 1   data            100 non-null    datetime64[ns]
 2   id_cliente      100 non-null    int64
 3   id_produto      100 non-null    int64
 4   quantidade      100 non-null    int64
 5   preco_unitario  100 non-null    float64
 6   desconto        72 non-null     float64
 7   custo           100 non-null    float64
 8   canal           100 non-null    object
dtypes: datetime64[ns](1), float64(3), int64(4), object(1)
memory usage: 7.2+ KB

In [48]:
#verificando dados nulos

vendas.isnull().sum()

id_venda           0
data               0
id_cliente         0
id_produto         0
quantidade         0
preco_unitario     0
desconto          28
custo              0
canal              0
dtype: int64

In [52]:
# tratando os valores nulos 

vendas["desconto"] = vendas["desconto"].fillna(0)
vendas.isnull().sum()

id_venda          0
data              0
id_cliente        0
id_produto        0
quantidade        0
preco_unitario    0
desconto          0
custo             0
canal             0
dtype: int64

In [54]:
#verificando a coluna "Canal"

vendas["canal"].unique()

array(['Parceiro', 'Loja', 'Site'], dtype=object)

In [55]:
# salvando a tabela "vendas"

vendas.to_excel("vendas_dados_tratados.xlsx",index=False)

# Resumo:

A primeira fase foi dedicada à Limpeza e Padronização dos Dados. Foram executados procedimentos de imputação (tratamento de valores nulos), desduplicação e validação de consistência (correção de informações divergentes), resultando em um dataset confiável e pronto para o processamento.